workstation/openfoam-master-tutorials/tutorials/incompressible/pimpleFoam/laminar/inclinedPlaneFilm/system/faSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phif_film,hf_film)         Gauss Gamma 0.5;
    div(phi2s_film,Uf_film)        Gauss linearUpwind;
}

laplacianSchemes
{
    default         none;
    laplacian(hf_film) Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

lnGradSchemes
{
    default         corrected;
}

fluxRequired
{
    hf_film         true;
}


// ************************************************************************* //
